Revit 2024 API
StructuralSectionErrorCode Enumeration
 Error codes for StructuralSection related operations.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Since: 2018
Syntax
C#
public enum StructuralSectionErrorCode
Visual Basic
Public Enumeration StructuralSectionErrorCode
Visual C++
public enum class StructuralSectionErrorCode
Members
Member name | Description
Success
Failure
ShapeNotRecognized
IncompleteDefinition
ElementNotSupported
MediumDetailShapeHasRounding
MediumAndFineDetailShapesAreInconsistent
ElementHasIndependentJustification
See Also
Autodesk.Revit.DB.Structure.StructuralSections Namespace